IDEA Open Model
Vector2D Class
Compatible with IDEA StatiCa v 10.1
 Represents a vector in two-dimensional space.
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.Geometry2D.Vector2D
 Namespace: IdeaRS.OpenModel.Geometry2D
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.1.1 (10.1.1.1)
Syntax
public class Vector2D : OpenObject
Public Class Vector2D
	Inherits OpenObject
public ref class Vector2D : public OpenObject
The Vector2D type exposes the following members.
Constructors
Name | Description
Vector2D
Initializes a new instance of the Vector2D class
Top
Properties
Name | Description
X
 Gets or sets the X-dirrection value
Y
 Gets or sets the Y-dirrection value
Top
See Also
Reference
IdeaRS.OpenModel.Geometry2D Namespace